app/views/parties/_partyreceipt.html.erb

<h2 class="ui header"> View Receipt
  <div class="ui sub header">Table <%= @party.table.table_num %>, Party of <%= @party.size %></div>
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 1]]

    <div class="ui two column centered grid">
      <% @party.customers.each do |customer| %>
---
SELECT "customers".* FROM "customers" WHERE "customers"."party_id" = $1  [["party_id", 1]]


        <% customer.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 7]]