app/views/parties/show.html.erb

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 1]]
---

<h1>Table <%= @party.table.table_num %> > Party of <%= @party.size %> </h1>

SELECT "customers".* FROM "customers" WHERE "customers"."party_id" = $1  [["party_id", 10]]
---
    <div class="ui vertical segment"></div>
      <% @party.customers.each do |customer| %>

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 11]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 38]]
---
          <div class="ui sub header">Guest <%= customer.customer_num %>
            <div class="small ui label"><%= customer.orders.size %></div>