app/views/customers/show.html.erb

      <% else %>
        <% @customer.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 12]]