app/controllers/customers_controller.rb

  def show
    @customer = Customer.find(params[:id])
    @items = Item.all
    @drinks = Item.where(itype_id: [1,2,3,4])
    @appetizers = Item.where(itype_id: 5)
    @entrees = Item.where(itype_id: 6)
    @desserts = Item.where(itype_id: 7)
    @sides = Item.where(itype_id: 8)
    @new_order = Order.new
    @order_size = Order.where(customer_id: @customer.id).size
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."itype_id" = $1  [["itype_id", 5]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 12]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 38]]