app/controllers/orders_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", nil]]
---
  def index
    @customer = Customer.find(params[:customer_id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."itype_id" = $1  [["itype_id", 5]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 11]]
---
  def new
    @customer = Customer.find(params[:customer_id])
    @items = Item.all
    @drinks = Item.where(itype_id: [1,2,3,4])
    @appetizers = Item.where(itype_id: 5)
    @entrees = Item.where(itype_id: 6)
    @desserts = Item.where(itype_id: 7)
    @sides = Item.where(itype_id: 8)
    @new_order = Order.new
    @order_size = Order.where(customer_id: @customer.id).size

INSERT INTO "orders" ("comments", "customer_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comments", "No"], ["customer_id", 28], ["item_id", 1], ["created_at", "2016-04-22 05:18:46.625497"], ["updated_at", "2016-04-22 05:18:46.625497"]]
---
  def create
    new_order = Order.create(order_params)