app/controllers/parties_controller.rb

  def index
    @new_party = Party.new
    @tables = Table.all.order(:id)
---
SELECT "tables".* FROM "tables"  ORDER BY "tables"."id" ASC

  def new
    @party = Party.new
    @table = Table.find(params[:table_id])
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", nil]]

  def show
    @party = Party.find(params[:id])
    @customers = Customer.where(party_id: @party.id)
    @total = 0
    @customers.each do |customer|
      customer.orders.each do |order|
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "customers".* FROM "customers" WHERE "customers"."party_id" = $1  [["party_id", 10]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 7]]

  def create
    party = Party.create(party_params.merge({user_id: current_user.id}))
    current_table = Table.find(party.table_id)
    current_table.update_column(:is_available, 0)
    for i in 1..party.size
      Customer.create(customer_num: i, party_id: party.id)
---
INSERT INTO "parties" ("size", "table_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["size", 1], ["table_id", 1], ["user_id", 1], ["created_at", "2016-04-21 04:16:43.019650"], ["updated_at", "2016-04-21 04:16:43.019650"]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "tables" SET "is_available" = 0 WHERE "tables"."id" = $1  [["id", 2]]
INSERT INTO "customers" ("customer_num", "party_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["customer_num", 1], ["party_id", 10], ["created_at", "2016-04-21 05:07:12.855151"], ["updated_at", "2016-04-21 05:07:12.855151"]]

  def update
    party = Party.find(params[:id])
    party.update(party_params)
    if (party.is_paid == 1)
      party.table.update_column(:is_available, 1)
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "parties" SET "is_paid" = $1, "updated_at" = $2 WHERE "parties"."id" = $3  [["is_paid", 1], ["updated_at", "2016-04-22 01:33:16.166128"], ["id", 2]]
UPDATE "tables" SET "is_available" = 1 WHERE "tables"."id" = $1  [["id", 2]]