app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

INSERT INTO "tables" ("table_num", "num_seats", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["table_num", 1], ["num_seats", 4], ["created_at", "2016-04-21 01:40:20.941722"], ["updated_at", "2016-04-21 01:40:20.941722"]]
---
  def create
    table = Table.create(table_params)